In [144]:
2 * (3 + 4)

14

In [146]:
(2 * 3) + 4

10

In [148]:
3 + 4

7

In [150]:
print(7 + 8)

15

In [152]:
print('hello ' + 'world')

hello world

In [154]:
print(7 + '8')

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [156]:
type("A")

str

In [158]:
type(3)

int

In [160]:
type(2.4)

float

In [162]:
print(1 + 2.5)

3.5

In [164]:
print('2 + 2 = ' + str(2 + 2))

2 + 2 = 4

In [166]:
print('Black dove, where will you g0?')

Black dove, where will you g0?

In [168]:
number = 15

number = str(number)
type(number)

str

In [170]:
number = 15
type(number)

int

In [172]:
def greeting(name):
    print('Welcome, ' + name + '!')
    print('Your are part of the team!')

In [174]:
greeting('naveenbabu')

Welcome, naveenbabu!
Your are part of the team!

In [176]:
def area_triangle(base, height):
    return base * height / 2

In [178]:
area_a = area_triangle(5, 4)
area_b = area_triangle(7, 3)

total_area = area_a + area_b
total_area

20.5

In [180]:
def get_seconds(hours, minutes, seconds):
    total_seconds = 3600*hours + 60*minutes + seconds
    return total_seconds

get_seconds(16, 45, 20)

60320

In [182]:
name = 'Marisol'
number = len(name)*9
print("Hello " + name + ". Your lucky number is " + str(number))

name = 'Ardashir'
number = len(name)*9
print("Hello {}. Your lucky number is {} ".format(name, str(number)))

Hello Marisol. Your lucky number is 63
Hello Ardashir. Your lucky number is 72

In [184]:
def lucky_number(name):
    number = len(name)*9
    print("Hello " + name + ". Your lucky number is " + str(number))

lucky_number("Marisol")
lucky_number("Ardashir")

Hello Marisol. Your lucky number is 63
Hello Ardashir. Your lucky number is 72

In [186]:
a = input(); y = 1

for i in range(int(a)):
    y = y*(i+1)
    print(y)

 1

1

In [188]:
#This function takes an integer as an input and returns its factorial
def factorial(n):
    # Exclude 0 as product, start with 1
    y = 1
    for i in range(int(n)):
        y = y*(i+1)
    return y

# Enter a numerical value between 1-19 in the command line that appears
input_num = input()
# Apply factorial function to an integer input
print(factorial(input_num))

 5

120

In [190]:
def seed_calculator(fountain_side, grass_width):
    '''
    Calculate nuumber of kilograms of grass seed needed for a border around a square fountain.

      Parameters:
         fountain_side (num): length of 1 side of fountain in meters
         grass_width (num): width of grass border in meters

      Returns:
         seed (float): amount of seed (kg) needed for grass border

    '''

    # Area of fountain
    fountain_area = fountain_side**2
    # Total area
    total_area = (fountain_side + 2 * grass_width) ** 2
    # Area of grass border
    grass_area = total_area - fountain_area
    # Amount of seed needed (35 g/sq.m)
    seed = grass_area * 35
    # Convert to kg
    seed = seed / 1000

    return seed

In [192]:
seed_calculator(12, 2)

3.92

In [194]:
print(10>1)

True

In [196]:
print('cat' == 'dog')

False

In [198]:
print(1 != 2)

True

In [200]:
print("Yellow" > "Cyan" and "Brown" > "Magenta")

False

In [202]:
print(25 > 50 or 1 != 2)

True

In [204]:
print(not 42 == "Answer")

True

In [206]:
def hint_username(username):
    if len(username) < 8:
        print("Invalid username. Must be at least 8 characters long.")
    else:
        print("valid username.")

In [208]:
hint_username("naveen")

Invalid username. Must be at least 8 characters long.

In [210]:
5 % 2

1

In [212]:
11 % 3

2

In [214]:
10 % 2

0

In [216]:
def is_even(number):
    if number % 2 == 0:
        return True
    return False

In [218]:
is_even(19)

False

In [220]:
def hint_username(username):
    if len(username) < 8:
        print("Invalid username. Must be at least 8 characters long.")
    elif len(username) > 15:
        print("Invalid username. Cannot exceed is characters.")
    else:
        print("valid username.")

In [222]:
hint_username("naveenbabubathula")

Invalid username. Cannot exceed is characters.

In [224]:
x = 0
while x < 5:
    print("Not there yet, x = " + str(x))
    x = x + 1
print("x = " + str(x))

Not there yet, x = 0
Not there yet, x = 1
Not there yet, x = 2
Not there yet, x = 3
Not there yet, x = 4
x = 5

In [228]:
import random

number = random.randint(1, 25)
number_of_guesses = 0

while number_of_guesses < 5:
    print("Guess a number between 1 and 25: ")
    guess = input()
    guess = int(guess)
    number_of_guesses += 1


    if guess == number:
        break
    elif number_of_guesses == 5:
        break
    else:
        print('Nope! Try again.')

if guess == number:
    print('Correct! You guessed the number in ' + str(number_of_guesses) + 'tries!')
else:
    print('You did not guess the number, The number was ' + str(number) + '.')

Guess a number between 1 and 25:

 4

Nope! Try again.
Guess a number between 1 and 25:

 8

Nope! Try again.
Guess a number between 1 and 25:

 13

Nope! Try again.
Guess a number between 1 and 25:

 23

Nope! Try again.
Guess a number between 1 and 25:

 9

You did not guess the number, The number was 7.

In [230]:
for x in range(5):
    print(x)

0
1
2
3
4

In [232]:
x = 0
while x < 5:
    print('x = ' + str(x))
    x = x + 1
print('x = ' + str(x))

x = 0
x = 1
x = 2
x = 3
x = 4
x = 5

In [234]:
with open('Python Tuples.ipynb') as f:
    for line in f:
        print(line)
print('\nI\'m done.')

{

 "cells": [

  {

   "cell_type": "code",

   "execution_count": 1,

   "id": "069cf7cf-9853-4609-a903-9888101b8db4",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "tuple"

      ]

     },

     "execution_count": 1,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "veggies = ('tomato',)\n",

    "type (veggies)"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 11,

   "id": "ceff95ac-6365-4b41-a8ce-a2132f2aa0d0",

   "metadata": {},

   "outputs": [

    {

     "name": "stdout",

     "output_type": "stream",

     "text": [

      "Sorry, not found\n"

     ]

    }

   ],

   "source": [

    "veggies=('tomato','onion','potato')\n",

    "if 'Cauliflower' in veggies:\n",

    "    print('Cauliflower is found')\n",

    "else:\n",

    "    print('Sorry, not found')"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 13,

   "id": "e68851d3-85e3-415f-a441-c5df1b359b0d",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "('tomato', 'onion', 'potato')"

      ]

     },

     "execution_count": 13,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "veggies[0:4]"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 15,

   "id": "2f96bee4-f18c-4493-b352-8ebf9c7b7f9c",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "('tomato', 'onion', 'potato')"

      ]

     },

     "execution_count": 15,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "veggies[ :4]"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 17,

   "id": "883c83a3-cd10-4eba-9f74-7135b07aa794",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "('tomato', 'onion', 'potato')"

      ]

     },

     "execution_count": 17,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "veggies[0: ]"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 19,

   "id": "b8e04ea0-ccaa-4d99-93ce-60e2be279b24",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "('tomato', 'onion', 'potato')"

      ]

     },

     "execution_count": 19,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "veggies[ : ]"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 21,

   "id": "e53d1605-9741-4e89-ab65-de54a2566969",

   "metadata": {},

   "outputs": [],

   "source": [

    "x = (90,40,50,100)\n",

    "y=list(x)"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 23,

   "id": "f405a47d-b521-43e0-b594-afa54b56ba89",

   "metadata": {},

   "outputs": [

    {

     "data": {

      "text/plain": [

       "(90, 5, 50, 100)"

      ]

     },

     "execution_count": 23,

     "metadata": {},

     "output_type": "execute_result"

    }

   ],

   "source": [

    "y[1]=5\n",

    "x=tuple(y)\n",

    "x"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 25,

   "id": "00e1d20b-30f9-48f1-a575-20d7c0280adf",

   "metadata": {},

   "outputs": [

    {

     "name": "stdout",

     "output_type": "stream",

     "text": [

      "banana\n"

     ]

    }

   ],

   "source": [

    "fruits = ('apple','banana','kiwi','guava','melon')\n",

    "(red,yellow,*green) = fruits\n",

    "print(yellow)"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": 27,

   "id": "97a66450-184a-4956-82f9-e17a4b90a9d1",

   "metadata": {},

   "outputs": [

    {

     "ename": "ValueError",

     "evalue": "too many values to unpack (expected 3)",

     "output_type": "error",

     "traceback": [

      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",

      "\u001b[1;31mValueError\u001b[0m                                Traceback (most recent call last)",

      "Cell \u001b[1;32mIn[27], line 2\u001b[0m\n\u001b[0;32m      1\u001b[0m fruits \u001b[38;5;241m=\u001b[39m (\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mapple\u001b[39m\u001b[38;5;124m'\u001b[39m,\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mbanana\u001b[39m\u001b[38;5;124m'\u001b[39m,\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mkiwi\u001b[39m\u001b[38;5;124m'\u001b[39m,\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mguava\u001b[39m\u001b[38;5;124m'\u001b[39m,\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mmelon\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[1;32m----> 2\u001b[0m (red,yellow,green) \u001b[38;5;241m=\u001b[39m fruits\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28mprint\u001b[39m(yellow)\n",

      "\u001b[1;31mValueError\u001b[0m: too many values to unpack (expected 3)"

     ]

    }

   ],

   "source": [

    "fruits = ('apple','banana','kiwi','guava','melon')\n",

    "(red,yellow,green) = fruits\n",

    "print(yellow)"

   ]

  },

  {

   "cell_type": "code",

   "execution_count": null,

   "id": "2e7cf618-264f-467f-9cbf-04b90afff7aa",

   "metadata": {},

   "outputs": [],

   "source": []

  }

 ],

 "metadata": {

  "kernelspec": {

   "display_name": "Python 3 (ipykernel)",

   "language": "python",

   "name": "python3"

  },

  "language_info": {

   "codemirror_mode": {

    "name": "ipython",

    "version": 3

   },

   "file_extension": ".py",

   "mimetype": "text/x-python",

   "name": "python",

   "nbconvert_exporter": "python",

   "pygments_lexer": "ipython3",

   "version": "3.12.7"

  }

 },

 "nbformat": 4,

 "nbformat_minor": 5

}


I'm done.

In [236]:
product = 1
for i in range(1, 10):
    product *= i

print(product)

362880

In [238]:
def to_celsius(x):
    return (x - 32) * 5/9

for x in range(10, 101, 10):
    print(x, to_celsius(x))

10 -12.222222222222221
20 -6.666666666666667
30 -1.1111111111111112
40 4.444444444444445
50 10.0
60 15.555555555555555
70 21.11111111111111
80 26.666666666666668
90 32.22222222222222
100 37.77777777777778

In [240]:
'Hello' + 'world'

'Helloworld'

In [242]:
'Hello' + ' world'

'Hello world'

In [244]:
'Hello' + ' ' +'world'

'Hello world'

In [246]:
greeting_1 = 'Hello '
greeting_2 = 'world'
greeting_1 + greeting_2

'Hello world'

In [248]:
danger = 'Danger! '
danger * 3

'Danger! Danger! Danger! '

In [250]:
danger - 2

TypeError: unsupported operand type(s) for -: 'str' and 'int'

In [252]:
quote = ''' Thank you pressing the self.destruct button'''
print(quote)

 Thank you pressing the self.destruct button

In [254]:
quote = "\"It's dangerous to go alone!\""
print(quote)

"It's dangerous to go alone!"

In [256]:
greeting = "Good day, \nsir."
print(greeting)

Good day,
sir.

In [258]:
newline = "\\n represents newline in Python."
print(newline)

\n represents newline in Python.

In [260]:
python = "Python"
for letter in python:
    print(letter + 'ut')

Put
yut
tut
hut
out
nut

In [262]:
pets = 'cats & dogs'
pets.index('s')

3

In [264]:
pets.index('z')

ValueError: substring not found

In [266]:
name = 'Jolena'
name[0]

'J'

In [268]:
name[5]

'a'

In [270]:
name[6]

IndexError: string index out of range

In [272]:
sentense = 'A man, a plan, a canal, Panama!'
sentense[-1]

'!'

In [274]:
sentense[-2]

'a'

In [276]:
color = 'orange'
color[1:4]

'ran'

In [278]:
fruit = 'pineapple'
fruit[:4]

'pine'

In [280]:
fruit[4:]

'apple'

In [282]:
'banana' in fruit

False

In [284]:
'pineapple' in fruit

True

In [286]:
'orange' in color

True

In [288]:
'pink' in color

False

In [290]:
'apple' in fruit

True

In [292]:
name = 'Manuel'
number = 3
print("Hello {}, your lucky number is {} ".format(name, str(number)))

Hello Manuel, your lucky number is 3

In [294]:
print("Hello " + name + ", your lucky number is " + str(number))

Hello Manuel, your lucky number is 3

In [296]:
print("Hello {name}, your lucky number is {num} ".format(name=name, num=number))

Hello Manuel, your lucky number is 3

In [298]:
price = 7.75
with_tax = price * 1.07
print('Base price: ${} USD. \nwith_tax: ${} USD. '.format(price, with_tax))

Base price: $7.75 USD.
with_tax: $8.2925 USD.

In [300]:
print('Base price: ${:.2f} USD. \nwith tax: ${:.2f} USD. '.format(price, with_tax))

Base price: $7.75 USD.
with tax: $8.29 USD.

In [302]:
def to_celsius(x):
    return (x-32)* 5/9

for x in range(0, 101, 10):
    print("{:>3} F | {:>6.2f} C".format(x, to_celsius(x)))

  0 F | -17.78 C
 10 F | -12.22 C
 20 F |  -6.67 C
 30 F |  -1.11 C
 40 F |   4.44 C
 50 F |  10.00 C
 60 F |  15.56 C
 70 F |  21.11 C
 80 F |  26.67 C
 90 F |  32.22 C
100 F |  37.78 C

In [304]:
x = ['Now', 'we', 'are', 'cooking', 'with', 7, 'ingredients']
print(x[3])

cooking

In [306]:
x[1:3]

['we', 'are']

In [308]:
x[:2]

['Now', 'we']

In [310]:
x[2:]

['are', 'cooking', 'with', 7, 'ingredients']

In [312]:
type(x)

list

In [314]:
'This' in x

False

In [316]:
fruits = ['pineapple', 'banana', 'apple', 'melon']
print(fruits)

['pineapple', 'banana', 'apple', 'melon']

In [318]:
fruits.append('graps')

In [320]:
print(fruits)

['pineapple', 'banana', 'apple', 'melon', 'graps']

In [322]:
fruits.insert(1, 'orange')
print(fruits)

['pineapple', 'orange', 'banana', 'apple', 'melon', 'graps']

In [324]:
fruits.insert(0, 'mango')
print(fruits)

['mango', 'pineapple', 'orange', 'banana', 'apple', 'melon', 'graps']

In [326]:
fruits.remove('banana')
print(fruits)

['mango', 'pineapple', 'orange', 'apple', 'melon', 'graps']

In [328]:
fruits.remove('stawberry')

ValueError: list.remove(x): x not in list

In [330]:
fruits.pop(2)
print(fruits)

['mango', 'pineapple', 'apple', 'melon', 'graps']

In [332]:
power = '1.21'
power = power + ' gigawatts'
print(power)

1.21 gigawatts

In [334]:
power[0] = '2'

TypeError: 'str' object does not support item assignment

In [336]:
power = [1.21, 'gigawatts']
power[0] = 2.21
print(power)

[2.21, 'gigawatts']

In [338]:
fullname = ('Naveen', 'B', 'Bathula')
fullname[2] = 'Battala'
print(fullname)

TypeError: 'tuple' object does not support item assignment

In [340]:
fullname = fullname + ('jr',)
print(fullname)

('Naveen', 'B', 'Bathula', 'jr')

In [342]:
fullname = ['Masha', 'Z', 'Hopper']
fullname = tuple(fullname)
print(fullname)

('Masha', 'Z', 'Hopper')

In [344]:
type(fullname)

tuple

In [346]:
def to_dollars_cents(price):
    '''
    Split price [float] into dollars and cents.
    '''
    dollars = int(price // 1)
    cents = round(price % 1 * 100)

    return dollars, cents

In [348]:
to_dollars_cents(6.55)

(6, 55)

In [350]:
dollars, cents = to_dollars_cents(6.55)

In [352]:
print(dollars + 1)
print(cents + 1)

7
56

In [354]:
type(dollars)

int

In [356]:
team = [('Marta', 20, 'center'), ('Ana', 21, 'point guard'), ('Gabi', 22, 'shooting guard'), ('Luz', 21, 'power forward'), ('Lorena', 19, 'small forward'),]

In [358]:
for name, age, position in team:
    print(name)

Marta
Ana
Gabi
Luz
Lorena

In [360]:
for player in team:
    print(player[0])

Marta
Ana
Gabi
Luz
Lorena

In [402]:
team = [('Marta', 20, 'center'), 
        ('Ana', 21, 'point guard'), 
        ('Gabi', 22, 'shooting guard'), 
        ('Luz', 21, 'power forward'), 
        ('Lorena', 19, 'small forward'),
       ]

In [404]:
def player_position(players):
    result = []
    for name, age, position in players:
        result.append('Name: {:>19} \nposition: {:>15}\n'.format(name, position))

    return result

In [366]:
for player in player_position(team):
    print(player)

Name:               Marta
position:          center

Name:                 Ana
position:     point guard

Name:                Gabi
position:  shooting guard

Name:                 Luz
position:   power forward

Name:              Lorena
position:   small forward

In [368]:
for left in range(7):
    for right in range(left, 7):
        print(f"[{left}|{right}]", end=" ")
    print('\n')

[0|0] [0|1] [0|2] [0|3] [0|4] [0|5] [0|6]

[1|1] [1|2] [1|3] [1|4] [1|5] [1|6]

[2|2] [2|3] [2|4] [2|5] [2|6]

[3|3] [3|4] [3|5] [3|6]

[4|4] [4|5] [4|6]

[5|5] [5|6]

[6|6]

In [370]:
dominoes = []
for left in range(7):
    for right in range(left, 7):
        dominoes.append((left, right))
dominoes

[(0, 0),
 (0, 1),
 (0, 2),
 (0, 3),
 (0, 4),
 (0, 5),
 (0, 6),
 (1, 1),
 (1, 2),
 (1, 3),
 (1, 4),
 (1, 5),
 (1, 6),
 (2, 2),
 (2, 3),
 (2, 4),
 (2, 5),
 (2, 6),
 (3, 3),
 (3, 4),
 (3, 5),
 (3, 6),
 (4, 4),
 (4, 5),
 (4, 6),
 (5, 5),
 (5, 6),
 (6, 6)]

In [372]:
dominoes[4][1]

4

In [374]:
pips_from_loop = []
for domino in dominoes:
    pips_from_loop.append(domino[0] + domino[1])
print(pips_from_loop)

[0, 1, 2, 3, 4, 5, 6, 2, 3, 4, 5, 6, 7, 4, 5, 6, 7, 8, 6, 7, 8, 9, 8, 9, 10, 10, 11, 12]

In [376]:
pips_from_list_comp = [domino[0] + domino[1] for domino in dominoes]

In [378]:
pips_from_loop == pips_from_list_comp

True

In [382]:
zoo = dict(
    pen_1='monkeys',
    pen_2='zebras',
    pen_3='lions',
    )

zoo['pen_2']

'zebras'

In [394]:
zoo = {
    'pen_1': 'penguins',
    'pen_2': 'zebras',
    'pen_3': 'lions',
    }

zoo['zebras']

KeyError: 'zebras'

In [396]:
zoo['pen_4'] = 'crocodiles'
zoo

{'pen_1': 'penguins',
 'pen_2': 'zebras',
 'pen_3': 'lions',
 'pen_4': 'crocodiles'}

In [398]:
zoo[2]

KeyError: 2

In [400]:
print('pen_1' in zoo)
print('pen_7' in zoo)

True
False

In [406]:
team = [('Marta', 20, 'center'), 
        ('Ana', 21, 'point guard'), 
        ('Gabi', 22, 'shooting guard'),
        ('Luz', 21, 'power forward'), 
        ('Lorena', 19, 'small forward'),
        ('Sandra', 19, 'center'),
        ('Mari', 18, 'point guard'),
        ('Esme', 18, 'shooting guard'),
        ('Lin', 18, 'power forward'),
        ('Sol', 19, 'small forward'),
       ]

In [408]:
new_team = {}
for name, age, position in team:
    if position in new_team:
        new_team[position].append((name, age))
    else:
        new_team[position] = [(name, age)]
new_team

{'center': [('Marta', 20), ('Sandra', 19)],
 'point guard': [('Ana', 21), ('Mari', 18)],
 'shooting guard': [('Gabi', 22), ('Esme', 18)],
 'power forward': [('Luz', 21), ('Lin', 18)],
 'small forward': [('Lorena', 19), ('Sol', 19)]}

In [410]:
new_team['point guard']

[('Ana', 21), ('Mari', 18)]

In [412]:
for x in new_team:
    print(x)

center
point guard
shooting guard
power forward
small forward

In [414]:
new_team.keys()

dict_keys(['center', 'point guard', 'shooting guard', 'power forward', 'small forward'])

In [416]:
new_team.values()

dict_values([[('Marta', 20), ('Sandra', 19)], [('Ana', 21), ('Mari', 18)], [('Gabi', 22), ('Esme', 18)], [('Luz', 21), ('Lin', 18)], [('Lorena', 19), ('Sol', 19)]])

In [430]:
new_team.items()

dict_items([('center', [('Marta', 20), ('Sandra', 19)]), ('point guard', [('Ana', 21), ('Mari', 18)]), ('shooting guard', [('Gabi', 22), ('Esme', 18)]), ('power forward', [('Luz', 21), ('Lin', 18)]), ('small forward', [('Lorena', 19), ('Sol', 19)])])

In [432]:
x = set(['foo', 'bar', 'baz', 'foo'])
print(x)

{'foo', 'baz', 'bar'}

In [434]:
x = set(('foo', 'bar', 'baz', 'foo'))
print(x)

{'foo', 'baz', 'bar'}

In [436]:
x = set('foo')
print(x)

{'o', 'f'}

In [442]:
x = {'foo'}
print(type(x))

y = {}
print(type(y))

<class 'set'>
<class 'dict'>

In [444]:
x = {'foo'}
print(x)

{'foo'}

In [450]:
set_1 = {1, 2, 3, 4, 5, 6}
set_2 = {4, 5, 6, 7, 8, 9}

print(set_1.intersection(set_2))

print(set_1 & set_2)

{4, 5, 6}
{4, 5, 6}

In [456]:
x1 = {'foo', 'bar', 'baz'}
x2 = {'baz', 'qux', 'quux'}

print(x1.union(x2))

print(x1 | x2)

{'qux', 'foo', 'bar', 'quux', 'baz'}
{'qux', 'foo', 'bar', 'quux', 'baz'}

In [458]:
set_1 = {1, 2, 3, 4, 5, 6}
set_2 = {4, 5, 6, 7, 8, 9}

print(set_1.difference(set_2))

print(set_1 - set_2)

{1, 2, 3}
{1, 2, 3}

In [462]:
print(set_2.difference(set_1))
print(set_2 - set_1)

{8, 9, 7}
{8, 9, 7}

In [464]:
set1 = {1, 2, 3, 4, 5, 6}
set2 = {4, 5, 6, 7, 8, 9}

print(set2.symmetric_difference(set1))
print(set2 ^ set1)

{1, 2, 3, 7, 8, 9}
{1, 2, 3, 7, 8, 9}

In [484]:
import math
print(factorial(5))

120

In [486]:
import random
number = random.randint(1, 25)
print(number)

23

In [8]:
list_a = [1, 2, 3]
list_b = [2, 4, 6]

list_c = []
for i in range(len(list_a)):
    list_c.append(list_a[i] * list_b[i])
list_c

[2, 8, 18]

In [10]:
import numpy as np

array_a = np.array(list_a)
array_b = np.array(list_b)

array_a * array_b

array([ 2,  8, 18])

In [73]:
x = np.array([1, 2, 3, 4])
x

array([1, 2, 3, 4])

In [75]:
x[-1] = 5
x

array([1, 2, 3, 5])

In [77]:
x[4] = 10

IndexError: index 4 is out of bounds for axis 0 with size 4

In [79]:
arr = np.array([1, 2, 'coconur'])
arr

array(['1', '2', 'coconur'], dtype='<U21')

In [81]:
print(type(arr))

<class 'numpy.ndarray'>

In [83]:
arr = np.array([1, 2, 3])
arr.dtype

dtype('int64')

In [85]:
arr.shape

(3,)

In [87]:
arr.ndim

1

In [89]:
arr_2d = np.array([[1, 2], [3, 4], [5, 6], [7, 8]])
print(arr_2d.shape)
print(arr_2d.ndim)
arr_2d

(4, 2)
2

array([[1, 2],
       [3, 4],
       [5, 6],
       [7, 8]])

In [91]:
arr_3d = np.array([[[1, 2, 3],
                   [3, 4, 5]],

                   [[5, 6, 7],
                    [7, 8, 9]]]
)
print(arr_3d.shape)
print(arr_3d.ndim)
arr_3d

(2, 2, 3)
3

array([[[1, 2, 3],
        [3, 4, 5]],

       [[5, 6, 7],
        [7, 8, 9]]])

In [93]:
arr_2d = arr_2d.reshape(2, 4)
arr_2d

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [95]:
arr = np.array([1, 2, 3, 4, 5])
np.mean(arr)

np.float64(3.0)

In [97]:
np.log(arr)

array([0.        , 0.69314718, 1.09861229, 1.38629436, 1.60943791])

In [99]:
np.floor(5.7)

np.float64(5.0)

In [101]:
np.ceil(5.3)

np.float64(6.0)

In [4]:
import pandas as pd

In [105]:
dataframe = pd.read_csv("tested.csv")
dataframe.head(25)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,0,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
15,907,1,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,0,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
17,909,0,3,"Assaf, Mr. Gerios",male,21.0,0,0,2692,7.2250,NaN,C
18,910,1,3,"Ilmakangas, Miss. Ida Livija",female,27.0,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,1,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.0,0,0,2696,7.2250,NaN,C
20,912,0,1,"Rothschild, Mr. Martin",male,55.0,1,0,PC 17603,59.4000,NaN,C
21,913,0,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S
22,914,1,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,NaN,0,0,PC 17598,31.6833,NaN,S
23,915,0,1,"Williams, Mr. Richard Norris II",male,21.0,0,1,PC 17597,61.3792,NaN,C
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C

In [107]:
dataframe['Age'].mean()

np.float64(30.272590361445783)

In [109]:
dataframe['Age'].max()

np.float64(76.0)

In [111]:
dataframe['Age'].min()

np.float64(0.17)

In [113]:
dataframe['Age'].std()

np.float64(14.181209235624422)

In [115]:
dataframe['Pclass'].value_counts()

Pclass
3    218
1    107
2     93
Name: count, dtype: int64

In [117]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [119]:
dataframe[(dataframe['Age'] > 50) & (dataframe['Pclass'] == 2)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
193,1085,0,2,"Lingane, Mr. John",male,61.0,0,0,235509,12.3500,NaN,Q
213,1105,1,2,"Howard, Mrs. Benjamin (Ellen Truelove Arman)",female,60.0,1,0,24065,26.0000,NaN,S
387,1279,0,2,"Ashby, Mr. John",male,57.0,0,0,244346,13.0000,NaN,S

In [121]:
dataframe['2023_Fare'] = dataframe['Fare'] * 146.14
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,2023_Fare
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1144.159288
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1022.980000
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1415.731250
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1265.937750
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1795.695250
...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,1176.427000
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,15914.646000
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,1059.515000
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,1176.427000
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,3267.441962

In [123]:
fare = dataframe.groupby(['Sex', 'Pclass']).agg({'Fare': ['count', 'sum']})
fare['fare_avg'] = fare['Fare']['sum'] / fare['Fare']['count']
fare

               Fare               fare_avg
              count        sum
Sex    Pclass
female 1         50  5779.5584  115.591168
       2         30   793.1625   26.438750
       3         72   988.9293   13.735129
male   1         57  4308.4334   75.586551
       2         63  1271.6332   20.184654
       3        145  1714.8208   11.826350

In [125]:
data = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=data)
df

   col1  col2
0     1     3
1     2     4

In [127]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'], index=['x', 'y', 'z'])
df2

   a  b  c
x  1  2  3
y  4  5  6
z  7  8  9

In [129]:
df3 = pd.read_csv("tested.csv")
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [131]:
# Print class of first row
print(type(df3.iloc[0]))

# Print class of 'Name' column
print(type(df3['Name']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [133]:
titanic = df3
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [135]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [137]:
titanic.shape

(418, 12)

In [139]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [141]:
titanic['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [143]:
titanic.Age

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [145]:
titanic[["Name", "Age"]]

                                             Name   Age
0                                Kelly, Mr. James  34.5
1                Wilkes, Mrs. James (Ellen Needs)  47.0
2                       Myles, Mr. Thomas Francis  62.0
3                                Wirz, Mr. Albert  27.0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0
..                                            ...   ...
413                            Spector, Mr. Woolf   NaN
414                  Oliva y Ocana, Dona. Fermina  39.0
415                  Saether, Mr. Simon Sivertsen  38.5
416                           Ware, Mr. Frederick   NaN
417                      Peter, Master. Michael J   NaN

[418 rows x 2 columns]

In [147]:
titanic.iloc[0]

PassengerId                 892
Survived                      0
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [149]:
titanic.iloc[[0]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [151]:
titanic.iloc[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [153]:
titanic.iloc[0:3, [3, 4]]

                               Name     Sex
0                  Kelly, Mr. James    male
1  Wilkes, Mrs. James (Ellen Needs)  female
2         Myles, Mr. Thomas Francis    male

In [155]:
titanic.iloc[:, [3]].head()

                                           Name
0                              Kelly, Mr. James
1              Wilkes, Mrs. James (Ellen Needs)
2                     Myles, Mr. Thomas Francis
3                              Wirz, Mr. Albert
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

In [157]:
titanic.iloc[0, 3]

'Kelly, Mr. James'

In [159]:
titanic.loc[1:3, ['Name']]

                               Name
1  Wilkes, Mrs. James (Ellen Needs)
2         Myles, Mr. Thomas Francis
3                  Wirz, Mr. Albert

In [161]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'], 
        'radius_km': [2440, 6952, 6371, 3390, 69911, 58232, 25362, 24622],
        'moons': [0, 0, 1, 2, 80, 83, 27, 14]
        }
planets = pd.DataFrame(data)
planets

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [166]:
mask = planets['moons'] < 20
mask

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: moons, dtype: bool

In [168]:
planets[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [170]:
planets[planets['moons'] < 20]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [172]:
planets

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [174]:
moons_under_20 = planets[mask]
moons_under_20

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [176]:
mask = (planets['moons'] < 10) | (planets['moons'] > 50)
mask

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
Name: moons, dtype: bool

In [178]:
planets[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83

In [182]:
mask = (planets['moons'] > 20) & ~(planets['moons'] == 80) & ~(planets['radius_km'] < 50000)
planets[mask]

   planet  radius_km  moons
5  Saturn      58232     83

In [200]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'], 
        'radius_km': [2440, 6952, 6371, 3390, 69911, 58232, 25362, 24622],
        'moons': [0, 0, 1, 2, 80, 83, 27, 14],
        'type': ['terrestrial', 'terrestrial', 'terrestrial', 'terrestrial', 'gas giant', 'gas giant', 'ice giant', 'ice giant'],
        'rings': ['no', 'no', 'no', 'no', 'yes', 'yes', 'yes', 'yes'],
        'mean_temp_c': [167, 464, 15, -65, -110, -140, -195, -200],
        'magnetic_field': ['yes', 'no', 'yes', 'no', 'yes', 'yes', 'yes', 'yes']
        }
planets = pd.DataFrame(data)
planets

    planet  radius_km  moons         type rings  mean_temp_c magnetic_field
0  Mercury       2440      0  terrestrial    no          167            yes
1    Venus       6952      0  terrestrial    no          464             no
2    Earth       6371      1  terrestrial    no           15            yes
3     Mars       3390      2  terrestrial    no          -65             no
4  Jupiter      69911     80    gas giant   yes         -110            yes
5   Saturn      58232     83    gas giant   yes         -140            yes
6   Uranus      25362     27    ice giant   yes         -195            yes
7  Neptune      24622     14    ice giant   yes         -200            yes

In [202]:
planets.groupby(['type'])

In [216]:
planets.groupby(['type']).sum()

,planet,radius_km,moons,rings,mean_temp_c,magnetic_field
type,,,,,,
gas giant,JupiterSaturn,128143,163,yesyes,-250,yesyes
ice giant,UranusNeptune,49984,41,yesyes,-395,yesyes
terrestrial,MercuryVenusEarthMars,19153,3,nononono,581,yesnoyesno

In [206]:
planets.groupby(['type']).sum()[['moons']]

             moons
type
gas giant      163
ice giant       41
terrestrial      3

In [218]:
planets.groupby(['type', 'magnetic_field']).mean(numeric_only=True)

                            radius_km  moons  mean_temp_c
type        magnetic_field
gas giant   yes               64071.5   81.5       -125.0
ice giant   yes               24992.0   20.5       -197.5
terrestrial no                 5171.0    1.0        199.5
            yes                4405.5    0.5         91.0

In [224]:
numeric_cols = planets.select_dtypes(include='number').columns
planets.groupby(['type'])[numeric_cols].agg(['mean', 'median'])

            radius_km           moons        mean_temp_c
                 mean   median   mean median        mean median
type
gas giant    64071.50  64071.5  81.50   81.5     -125.00 -125.0
ice giant    24992.00  24992.0  20.50   20.5     -197.50 -197.5
terrestrial   4788.25   4880.5   0.75    0.5      145.25   91.0

In [240]:
def percentile_90(x):
    return x.quantile(0.9)

In [242]:
numeric_cols = planets.select_dtypes(include='number').columns
planets.groupby(['type', 'magnetic_field'])[numeric_cols].agg(['mean', percentile_90])

                           radius_km               moons                \
                                mean percentile_90  mean percentile_90
type        magnetic_field
gas giant   yes              64071.5       68743.1  81.5          82.7
ice giant   yes              24992.0       25288.0  20.5          25.7
terrestrial no                5171.0        6595.8   1.0           1.8
            yes               4405.5        5977.9   0.5           0.9

                           mean_temp_c
                                  mean percentile_90
type        magnetic_field
gas giant   yes                 -125.0        -113.0
ice giant   yes                 -197.5        -195.5
terrestrial no                   199.5         411.1
            yes                   91.0         151.8

In [15]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars'], 
        'radius_km': [2440, 6952, 6371, 3390],
        'moons': [0, 0, 1, 2]
        }
df1 = pd.DataFrame(data)
df1

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2

In [17]:
data = {'planet': ['Jupiter', 'Saturn', 'Uranus', 'Neptune'], 
        'radius_km': [69911, 58232, 25362, 24622],
        'moons': [80, 83, 27, 14]
        }
df2 = pd.DataFrame(data)
df2

    planet  radius_km  moons
0  Jupiter      69911     80
1   Saturn      58232     83
2   Uranus      25362     27
3  Neptune      24622     14

In [19]:
df3 = pd.concat([df1, df2], axis=0)
df3

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
0  Jupiter      69911     80
1   Saturn      58232     83
2   Uranus      25362     27
3  Neptune      24622     14

In [21]:
df3 = df3.reset_index(drop=True)
df3

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6952      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [23]:
data = {'planet': ['Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Janssen', 'Tadmor'], 
        'type': ['terrestrial', 'terrestrial', 'gas giant', 'gas giant', 'ice giant', 'ice giant', 'super earth', 'gas giant'],
        'rings': ['no', 'no', 'yes', 'yes', 'yes', 'yes', 'no', 'None'],
        'mean_temp_c': [15.0, -65.0, -110.0, -140.0, -195.0, -200.0, 'NaN', 'NaN'],
        'magnetic_field': ['yes', 'no', 'yes', 'yes', 'yes', 'yes', 'None', 'None'],
        'life': [1, 0, 0, 0, 0, 0, 1, 1]
        }
df4 = pd.DataFrame(data)
df4

    planet         type rings mean_temp_c magnetic_field  life
0    Earth  terrestrial    no        15.0            yes     1
1     Mars  terrestrial    no       -65.0             no     0
2  Jupiter    gas giant   yes      -110.0            yes     0
3   Saturn    gas giant   yes      -140.0            yes     0
4   Uranus    ice giant   yes      -195.0            yes     0
5  Neptune    ice giant   yes      -200.0            yes     0
6  Janssen  super earth    no         NaN           None     1
7   Tadmor    gas giant  None         NaN           None     1

In [25]:
inner = pd.merge(df3, df4, on='planet', how='inner')
inner

,planet,radius_km,moons,type,rings,mean_temp_c,magnetic_field,life
0,Earth,6371,1,terrestrial,no,15.0,yes,1
1,Mars,3390,2,terrestrial,no,-65.0,no,0
2,Jupiter,69911,80,gas giant,yes,-110.0,yes,0
3,Saturn,58232,83,gas giant,yes,-140.0,yes,0
4,Uranus,25362,27,ice giant,yes,-195.0,yes,0
5,Neptune,24622,14,ice giant,yes,-200.0,yes,0

In [31]:
outer = pd.merge(df3, df4, on='planet', how='outer')
outer

,planet,radius_km,moons,type,rings,mean_temp_c,magnetic_field,life
0,Earth,6371.0,1.0,terrestrial,no,15.0,yes,1.0
1,Janssen,NaN,NaN,super earth,no,NaN,None,1.0
2,Jupiter,69911.0,80.0,gas giant,yes,-110.0,yes,0.0
3,Mars,3390.0,2.0,terrestrial,no,-65.0,no,0.0
4,Mercury,2440.0,0.0,NaN,NaN,NaN,NaN,NaN
5,Neptune,24622.0,14.0,ice giant,yes,-200.0,yes,0.0
6,Saturn,58232.0,83.0,gas giant,yes,-140.0,yes,0.0
7,Tadmor,NaN,NaN,gas giant,None,NaN,None,1.0
8,Uranus,25362.0,27.0,ice giant,yes,-195.0,yes,0.0
9,Venus,6952.0,0.0,NaN,NaN,NaN,NaN,NaN

In [35]:
left = pd.merge(df3, df4, on='planet', how='left')
left

,planet,radius_km,moons,type,rings,mean_temp_c,magnetic_field,life
0,Mercury,2440,0,NaN,NaN,NaN,NaN,NaN
1,Venus,6952,0,NaN,NaN,NaN,NaN,NaN
2,Earth,6371,1,terrestrial,no,15.0,yes,1.0
3,Mars,3390,2,terrestrial,no,-65.0,no,0.0
4,Jupiter,69911,80,gas giant,yes,-110.0,yes,0.0
5,Saturn,58232,83,gas giant,yes,-140.0,yes,0.0
6,Uranus,25362,27,ice giant,yes,-195.0,yes,0.0
7,Neptune,24622,14,ice giant,yes,-200.0,yes,0.0

In [37]:
right = pd.merge(df3, df4, on='planet', how='right')
right

,planet,radius_km,moons,type,rings,mean_temp_c,magnetic_field,life
0,Earth,6371.0,1.0,terrestrial,no,15.0,yes,1
1,Mars,3390.0,2.0,terrestrial,no,-65.0,no,0
2,Jupiter,69911.0,80.0,gas giant,yes,-110.0,yes,0
3,Saturn,58232.0,83.0,gas giant,yes,-140.0,yes,0
4,Uranus,25362.0,27.0,ice giant,yes,-195.0,yes,0
5,Neptune,24622.0,14.0,ice giant,yes,-200.0,yes,0
6,Janssen,NaN,NaN,super earth,no,NaN,None,1
7,Tadmor,NaN,NaN,gas giant,None,NaN,None,1